bluestore/erasure5.3/write-4k.out
ceph-erasure-5-3: (g=0): rw=write, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
fio-2.2.10
Starting 1 process

ceph-erasure-5-3: (groupid=0, jobs=1): err= 0: pid=119806: Fri Jun 19 01:07:59 2020
  write: io=167572KB, bw=2791.2KB/s, iops=697, runt= 60036msec
    slat (usec): min=19, max=11375, avg=49.80, stdev=59.08
    clat (msec): min=8, max=388, avg=45.79, stdev=40.46
     lat (msec): min=8, max=388, avg=45.84, stdev=40.46
    clat percentiles (msec):
     |  1.00th=[   20],  5.00th=[   24], 10.00th=[   28], 20.00th=[   31],
     | 30.00th=[   34], 40.00th=[   35], 50.00th=[   37], 60.00th=[   40],
     | 70.00th=[   42], 80.00th=[   46], 90.00th=[   55], 95.00th=[   84],
     | 99.00th=[  255], 99.50th=[  277], 99.90th=[  343], 99.95th=[  379],
     | 99.99th=[  388]
    bw (KB  /s): min= 1042, max= 3896, per=100.00%, avg=2821.05, stdev=729.81
    lat (msec) : 10=0.01%, 20=1.19%, 50=84.80%, 100=9.52%, 250=3.21%
    lat (msec) : 500=1.27%
  cpu          : usr=0.70%, sys=4.24%, ctx=20975, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=99.9%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=41893/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
  WRITE: io=167572KB, aggrb=2791KB/s, minb=2791KB/s, maxb=2791KB/s, mint=60036msec, maxt=60036msec